## pd.concat()

https://zhuanlan.zhihu.com/p/69224745

`pandas.concat()` 通常用来连接DataFrame对象。默认情况下是对两个 `DataFrame` 对象进行纵向连接， 当然通过设置参数，也可以通过它实现 `DataFrame` 对象的横向连接。

In [3]:
import pandas as pd

### （1）两个DataFrame对象的列完全相同

In [4]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [5]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                  columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [6]:
# 合并对象
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

### (2) 两个DataFrame对象的列不完全相同

In [7]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [8]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                  columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [9]:
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog